[
  {
    "title": "01/09/1858",
    "content": "Liên quân Pháp - Tây Ban Nha nổ súng tiến công Đà Nẵng, mở đầu cuộc chiến tranh xâm lược Việt Nam. Liên quân Pháp - Tây Ban Nha đã bị quân dân ta cầm chân tại đây suốt 5 tháng",
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/bd/French_ships_at_Danang_1858.jpg"
  },
  {
    "title": "17/02/1859",
    "content": "Quân Pháp nổ súng đánh thành Gia Định. Quân đội triều Nguyễn thất bại và thành Gia Định cùng các đồn lũy quân sự khác dọc sông Lòng Tàu bị quân Pháp san phẳng.",
    "image": "https://upload.wikimedia.org/wikipedia/vi/thumb/5/55/Giadinh.jpg/330px-Giadinh.jpg"
  },
  {
    "title": "23/02/1861",
    "content": "Quân Pháp mở cuộc tấn công vào Đại đồn Chí Hòa. Quân ta kháng cự quyết liệt, nhưng trước hỏa lực của địch, Đại đồn Chí Hòa rơi vào tay địch.",
    "image": "https://trithucvn.org/wp-content/uploads/2021/06/Don-Chi-Hoa-ky-vong-nha-Nguyen-01.jpg"
  },
  {
    "title": "10/12/1861",
    "content": "Đội quân Nguyễn Trung Trực đánh chìm chiến hàm Et-pê-răng(Hi Vọng) của địch trên vàm Nhật Tảo (đoạn sông Vàm Cỏ Đông).",
    "image": "https://sohanews.sohacdn.com/zoom/700_438/2019/4/16/1322trc3a2cca3n-c491acc81nh-tacc80u-le28099esperance-trc3aan-sc3b4ng-nhc6b0cca3t-tacc89o-1555424766964554843265-crop-1555424783447903082803.jpg"
  },
  {
    "title": "05/06/1862",
    "content": "Hiệp ước Nhâm Tuất (1862) gồm 12 điều, hai nội dung quan trọng và nặng nề nhất là triều đình Huế phải nhượng cho Pháp ba tỉnh miền Đông Nam kỳ và Côn Đảo với tất cả chủ quyền (điều 3), và bồi thường chiến phí với số tiền lên đến 4 triệu franc bạc (tương đương 2.880.000 lạng bạc) trong vòng 10 năm (điều 8)",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Treaty_of_Saigon_1862.jpg/300px-Treaty_of_Saigon_1862.jpg"
  },
  {
    "title": "20/06/1867",
    "content": "Lợi dụng sự bạc nhược của triều đình, Pháp ép Phan Thanh Giản nộp thành Vĩnh Long không điều kiện. Sau đó, Pháp lần lượt chiếm 3 tỉnh Tây Nam Kì không tốn một viên đạn.",
    "image": "https://image.thanhnien.vn/w1024/Uploaded/2022/pwivoviu/2021_07_15/2_meru.jpg"
  },
  {
    "title": "20/11/1873",
    "content": "Quân Pháp nổ súng chiếm thành Hà Nội. Tổng đốc Nguyễn Tri Phương cùng quân sĩ chiến đấu dũng cảm những nhanh chóng thất bại.",
    "image": "https://baotanglichsu.vn/DataFiles/Uploaded/image/data%20Hung/tran%20danh%20dau%20tien%20cua%20phap%20o%20ha%20noi/14.jpg"
  },
  {
    "title": "21/12/1873",
    "content": "Quân đội do Hoàng Tá Viêm chỉ huy phối hợp với đội quân Cờ Đen của Lưu Vĩnh Phúc đã phục kích và tiêu diệt toán quân Pháp, trong đó có tên Tướng Garnier  tại khu vực Cầu Giấy.",
    "image": "https://upload.wikimedia.org/wikipedia/vi/3/3d/Garnier1.jpg"
  }
]